In [1]:
import pandas as pd
import numpy as np
import os

SFO data cleaning

In [2]:
path_to_file1 = os.path.join('Resources','SFO_Landing_statistics.csv')
SFO_Landing_statistics_df = pd.read_csv(path_to_file1)
SFO_Landing_statistics_df.head(2)

,Activity Period,Operating Airline,Operating Airline IATA Code,Published Airline,Published Airline IATA Code,GEO Summary,GEO Region,Landing Aircraft Type,Aircraft Body Type,Aircraft Manufacturer,Aircraft Model,Aircraft Version,Landing Count,Total Landed Weight
0,200204,ATA Airlines,TZ,ATA Airlines,TZ,Domestic,US,Passenger,Narrow Body,Boeing,757,200,83,16434000
1,200204,ATA Airlines,TZ,ATA Airlines,TZ,Domestic,US,Passenger,Narrow Body,Boeing,757,300,3,672000

In [3]:
path_to_file2 = os.path.join('Resources','SFO_Passanger_statistics.csv')
SFO_Passanger_statistics_df = pd.read_csv(path_to_file2)
SFO_Passanger_statistics_df.head(2)

,Activity Period,Operating Airline,Operating Airline IATA Code,Published Airline,Published Airline IATA Code,GEO Summary,GEO Region,Activity Type Code,Price Category Code,Terminal,Boarding Area,Passenger Count
0,200507,ATA Airlines,TZ,ATA Airlines,TZ,Domestic,US,Deplaned,Low Fare,Terminal 1,B,27271
1,200507,ATA Airlines,TZ,ATA Airlines,TZ,Domestic,US,Enplaned,Low Fare,Terminal 1,B,29131

In [4]:
#checking number of missing data
for column in SFO_Landing_statistics_df: 
    null_nr = SFO_Landing_statistics_df[column].isnull().sum()
    print(f'{column} has {null_nr} missing data' )

Activity Period has 0 missing data
Operating Airline has 0 missing data
Operating Airline IATA Code has 84 missing data
Published Airline has 0 missing data
Published Airline IATA Code has 84 missing data
GEO Summary has 0 missing data
GEO Region has 0 missing data
Landing Aircraft Type has 0 missing data
Aircraft Body Type has 0 missing data
Aircraft Manufacturer has 10 missing data
Aircraft Model has 0 missing data
Aircraft Version has 1215 missing data
Landing Count has 0 missing data
Total Landed Weight has 0 missing data

In [5]:
#checking number of missing data
for column in SFO_Passanger_statistics_df: 
    null_nr = SFO_Passanger_statistics_df[column].isnull().sum()
    print(f'{column} has {null_nr} missing data' )

Activity Period has 0 missing data
Operating Airline has 0 missing data
Operating Airline IATA Code has 63 missing data
Published Airline has 0 missing data
Published Airline IATA Code has 63 missing data
GEO Summary has 0 missing data
GEO Region has 0 missing data
Activity Type Code has 0 missing data
Price Category Code has 0 missing data
Terminal has 0 missing data
Boarding Area has 0 missing data
Passenger Count has 0 missing data

In [6]:
#only missig data are in columns that are useles for the analysis.
#Aircraft version is not not necessary for comparison with airlien fleet data base, we only need brand and model
#missing data IATA code kept for now
#removing columns: Operating Airline, Operating Airline IATA Code (those are just carriers not beneficient)
#removing column aircraft version

In [7]:
def name_cln(data_frame):
        data_frame = data_frame.drop(['Operating Airline','Operating Airline IATA Code'],1)
        #data_frame = data_frame.dropna(subset=['Aircraft Manufacturer'])
        return data_frame

def date_cln(data_frame):
    data_frame['Activity Period'] = data_frame['Activity Period'].apply(lambda dt: pd.to_datetime(dt, format='%Y%m', errors='coerce'))

    return data_frame

In [8]:
SFO_Passanger_statistics_df = SFO_Passanger_statistics_df.drop(['Terminal','Boarding Area'],1)
SFO_Landing_statistics_df = SFO_Landing_statistics_df.drop(['Aircraft Body Type','Aircraft Version'],1)

In [9]:
#cleaning SFO_Landing_statistics_df
SFO_Landing_statistics_df = name_cln(SFO_Landing_statistics_df)
SFO_Landing_statistics_df = date_cln(SFO_Landing_statistics_df)

In [10]:
# #cleaning SFO_Passanger_statistics_df
SFO_Passanger_statistics_df = name_cln(SFO_Passanger_statistics_df)
SFO_Passanger_statistics_df = date_cln(SFO_Passanger_statistics_df)

In [11]:
display(SFO_Landing_statistics_df)
display(SFO_Passanger_statistics_df)

,Activity Period,Published Airline,Published Airline IATA Code,GEO Summary,GEO Region,Landing Aircraft Type,Aircraft Manufacturer,Aircraft Model,Landing Count,Total Landed Weight
0,2002-04-01,ATA Airlines,TZ,Domestic,US,Passenger,Boeing,757,83,16434000
1,2002-04-01,ATA Airlines,TZ,Domestic,US,Passenger,Boeing,757,3,672000
2,2002-04-01,ATA Airlines,TZ,Domestic,US,Passenger,Lockheed,L1011,27,9666000
3,2002-04-01,Aeroflot Russian International Airlines,NaN,International,Europe,Passenger,Boeing,777,9,4139946
4,2002-04-01,Air Canada,AC,International,Canada,Passenger,Boeing,737,5,525000
...,...,...,...,...,...,...,...,...,...,...
21841,2018-06-01,WOW Air,WW,International,Europe,Passenger,Airbus,A333,30,12235650
21842,2018-06-01,WestJet Airlines,WS,International,Canada,Passenger,Boeing,B736,3,361500
21843,2018-06-01,WestJet Airlines,WS,International,Canada,Passenger,Boeing,B737,71,9173200
21844,2018-06-01,WestJet Airlines,WS,International,Canada,Passenger,Boeing,B738,16,2340800
21845,2018-06-01,XL Airways France,SE,International,Europe,Passenger,Airbus,A332,4,1604964

,Activity Period,Published Airline,Published Airline IATA Code,GEO Summary,GEO Region,Activity Type Code,Price Category Code,Passenger Count
0,2005-07-01,ATA Airlines,TZ,Domestic,US,Deplaned,Low Fare,27271
1,2005-07-01,ATA Airlines,TZ,Domestic,US,Enplaned,Low Fare,29131
2,2005-07-01,ATA Airlines,TZ,Domestic,US,Thru / Transit,Low Fare,5415
3,2005-07-01,Air Canada,AC,International,Canada,Deplaned,Other,35156
4,2005-07-01,Air Canada,AC,International,Canada,Enplaned,Other,34090
...,...,...,...,...,...,...,...,...
18880,2018-06-01,WOW Air,WW,International,Europe,Enplaned,Other,50
18881,2018-06-01,WestJet Airlines,WS,International,Canada,Deplaned,Other,10868
18882,2018-06-01,WestJet Airlines,WS,International,Canada,Enplaned,Other,11664
18883,2018-06-01,XL Airways France,SE,International,Europe,Deplaned,Other,804
18884,2018-06-01,XL Airways France,SE,International,Europe,Enplaned,Other,1243

In [12]:
SFO_Landing_statistics_df.dtypes

Activity Period                datetime64[ns]
Published Airline                      object
Published Airline IATA Code            object
GEO Summary                            object
GEO Region                             object
Landing Aircraft Type                  object
Aircraft Manufacturer                  object
Aircraft Model                         object
Landing Count                           int64
Total Landed Weight                     int64
dtype: object

In [13]:
SFO_Passanger_statistics_df.dtypes

Activity Period                datetime64[ns]
Published Airline                      object
Published Airline IATA Code            object
GEO Summary                            object
GEO Region                             object
Activity Type Code                     object
Price Category Code                    object
Passenger Count                         int64
dtype: object

Grand datased on Air traffic at SFO

In [14]:
#merging 2 main data frames into 1 based on data stamp 
SFO_data_df = pd.merge(SFO_Passanger_statistics_df,SFO_Landing_statistics_df, how = 'left',on=["Activity Period", "Activity Period"])

In [15]:
SFO_data_df

,Activity Period,Published Airline_x,Published Airline IATA Code_x,GEO Summary_x,GEO Region_x,Activity Type Code,Price Category Code,Passenger Count,Published Airline_y,Published Airline IATA Code_y,GEO Summary_y,GEO Region_y,Landing Aircraft Type,Aircraft Manufacturer,Aircraft Model,Landing Count,Total Landed Weight
0,2005-07-01,ATA Airlines,TZ,Domestic,US,Deplaned,Low Fare,27271,ABX Air,GB,Domestic,US,Freighter,McDonnell Douglas,DC-9,40,4066000
1,2005-07-01,ATA Airlines,TZ,Domestic,US,Deplaned,Low Fare,27271,ABX Air,GB,Domestic,US,Freighter,McDonnell Douglas,DC-9,1,102000
2,2005-07-01,ATA Airlines,TZ,Domestic,US,Deplaned,Low Fare,27271,ATA Airlines,TZ,Domestic,US,Passenger,Boeing,757,2,396000
3,2005-07-01,ATA Airlines,TZ,Domestic,US,Deplaned,Low Fare,27271,ATA Airlines,TZ,Domestic,US,Passenger,Boeing,757,167,37408000
4,2005-07-01,ATA Airlines,TZ,Domestic,US,Deplaned,Low Fare,27271,Air Canada,AC,International,Canada,Passenger,Boeing,767,1,320000
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2626379,2018-06-01,XL Airways France,SE,International,Europe,Enplaned,Other,1243,WOW Air,WW,International,Europe,Passenger,Airbus,A333,30,12235650
2626380,2018-06-01,XL Airways France,SE,International,Europe,Enplaned,Other,1243,WestJet Airlines,WS,International,Canada,Passenger,Boeing,B736,3,361500
2626381,2018-06-01,XL Airways France,SE,International,Europe,Enplaned,Other,1243,WestJet Airlines,WS,International,Canada,Passenger,Boeing,B737,71,9173200
2626382,2018-06-01,XL Airways France,SE,International,Europe,Enplaned,Other,1243,WestJet Airlines,WS,International,Canada,Passenger,Boeing,B738,16,2340800
2626383,2018-06-01,XL Airways France,SE,International,Europe,Enplaned,Other,1243,XL Airways France,SE,International,Europe,Passenger,Airbus,A332,4,1604964

In [16]:
#dropping y columns
SFO_data_df  = SFO_data_df .drop(['Published Airline IATA Code_y','GEO Summary_y', 'GEO Region_y', 'Published Airline IATA Code_y'],1)

In [17]:
#renaming x columns
SFO_data_df  = SFO_data_df .rename(columns={"Published Airline_x": "Published Airline", "Published Airline IATA Code_x" : "Published Airline IATA Code",
                                               "GEO Summary_x" : "GEO Summary", "GEO Region_x" : "GEO Region"})

In [18]:
SFO_data_df.head(5)

,Activity Period,Published Airline,Published Airline IATA Code,GEO Summary,GEO Region,Activity Type Code,Price Category Code,Passenger Count,Published Airline_y,Landing Aircraft Type,Aircraft Manufacturer,Aircraft Model,Landing Count,Total Landed Weight
0,2005-07-01,ATA Airlines,TZ,Domestic,US,Deplaned,Low Fare,27271,ABX Air,Freighter,McDonnell Douglas,DC-9,40,4066000
1,2005-07-01,ATA Airlines,TZ,Domestic,US,Deplaned,Low Fare,27271,ABX Air,Freighter,McDonnell Douglas,DC-9,1,102000
2,2005-07-01,ATA Airlines,TZ,Domestic,US,Deplaned,Low Fare,27271,ATA Airlines,Passenger,Boeing,757,2,396000
3,2005-07-01,ATA Airlines,TZ,Domestic,US,Deplaned,Low Fare,27271,ATA Airlines,Passenger,Boeing,757,167,37408000
4,2005-07-01,ATA Airlines,TZ,Domestic,US,Deplaned,Low Fare,27271,Air Canada,Passenger,Boeing,767,1,320000

In [19]:
#removing Nan
SFO_data_df = SFO_data_df .dropna()

In [20]:
#removing duplicates
SFO_data_df = SFO_data_df.drop_duplicates()

In [21]:
#checking for remaning duplicates
for column in SFO_data_df:
    null = SFO_data_df[column].isnull().sum()
    print(f'{column} has {null} missing values')

Activity Period has 0 missing values
Published Airline has 0 missing values
Published Airline IATA Code has 0 missing values
GEO Summary has 0 missing values
GEO Region has 0 missing values
Activity Type Code has 0 missing values
Price Category Code has 0 missing values
Passenger Count has 0 missing values
Published Airline_y has 0 missing values
Landing Aircraft Type has 0 missing values
Aircraft Manufacturer has 0 missing values
Aircraft Model has 0 missing values
Landing Count has 0 missing values
Total Landed Weight has 0 missing values

In [22]:
SFO_data_df.dtypes

Activity Period                datetime64[ns]
Published Airline                      object
Published Airline IATA Code            object
GEO Summary                            object
GEO Region                             object
Activity Type Code                     object
Price Category Code                    object
Passenger Count                         int64
Published Airline_y                    object
Landing Aircraft Type                  object
Aircraft Manufacturer                  object
Aircraft Model                         object
Landing Count                           int64
Total Landed Weight                     int64
dtype: object

In [23]:
SFO_data_df

,Activity Period,Published Airline,Published Airline IATA Code,GEO Summary,GEO Region,Activity Type Code,Price Category Code,Passenger Count,Published Airline_y,Landing Aircraft Type,Aircraft Manufacturer,Aircraft Model,Landing Count,Total Landed Weight
0,2005-07-01,ATA Airlines,TZ,Domestic,US,Deplaned,Low Fare,27271,ABX Air,Freighter,McDonnell Douglas,DC-9,40,4066000
1,2005-07-01,ATA Airlines,TZ,Domestic,US,Deplaned,Low Fare,27271,ABX Air,Freighter,McDonnell Douglas,DC-9,1,102000
2,2005-07-01,ATA Airlines,TZ,Domestic,US,Deplaned,Low Fare,27271,ATA Airlines,Passenger,Boeing,757,2,396000
3,2005-07-01,ATA Airlines,TZ,Domestic,US,Deplaned,Low Fare,27271,ATA Airlines,Passenger,Boeing,757,167,37408000
4,2005-07-01,ATA Airlines,TZ,Domestic,US,Deplaned,Low Fare,27271,Air Canada,Passenger,Boeing,767,1,320000
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2626379,2018-06-01,XL Airways France,SE,International,Europe,Enplaned,Other,1243,WOW Air,Passenger,Airbus,A333,30,12235650
2626380,2018-06-01,XL Airways France,SE,International,Europe,Enplaned,Other,1243,WestJet Airlines,Passenger,Boeing,B736,3,361500
2626381,2018-06-01,XL Airways France,SE,International,Europe,Enplaned,Other,1243,WestJet Airlines,Passenger,Boeing,B737,71,9173200
2626382,2018-06-01,XL Airways France,SE,International,Europe,Enplaned,Other,1243,WestJet Airlines,Passenger,Boeing,B738,16,2340800
2626383,2018-06-01,XL Airways France,SE,International,Europe,Enplaned,Other,1243,XL Airways France,Passenger,Airbus,A332,4,1604964

Airline info DB

## Airline name DB

In [24]:
# I retrieve dataframe of all arilines using SFO_Passanger_statistics_df

In [25]:
#creating SFO airline list
SFO_airline_info_df = SFO_Passanger_statistics_df.copy()

In [26]:
#drppint unnecessary columns
SFO_airline_info_df = SFO_airline_info_df.drop(['Activity Type Code'],1)

In [27]:
#Filtering out the airlines, keeping division for domestic and international and price category
SFO_airline_info_df = SFO_airline_info_df.drop_duplicates(subset=['Published Airline','GEO Summary','Price Category Code'], keep = 'first')

In [28]:
#checking NaN
for column in SFO_airline_info_df:
    null = SFO_airline_info_df[column].isnull().sum()
    print(f'{column} has {null} missing values')

Activity Period has 0 missing values
Published Airline has 0 missing values
Published Airline IATA Code has 7 missing values
GEO Summary has 0 missing values
GEO Region has 0 missing values
Price Category Code has 0 missing values
Passenger Count has 0 missing values

In [29]:
#SFO_airline_info_df.head(5)

In [30]:
airline_name_df = SFO_airline_info_df.copy()

In [31]:
airline_name_df = airline_name_df.drop_duplicates(subset=['Published Airline'], keep = 'first') 
airline_name_df = airline_name_df.drop(['Activity Period','GEO Summary', 'GEO Region','Price Category Code', 'Passenger Count'],1)

In [32]:
airline_name_df = airline_name_df.dropna()

In [33]:
for column in airline_name_df:
    null = airline_name_df[column].isnull().sum()
    print(f'{column} has {null} missing values')

Published Airline has 0 missing values
Published Airline IATA Code has 0 missing values

In [34]:
airline_name_df = airline_name_df.dropna()

In [35]:
airline_name_df

                              Published Airline Published Airline IATA Code
0                                  ATA Airlines                          TZ
3                                    Air Canada                          AC
5                                     Air China                          CA
7                                    Air France                          AF
9                               Air New Zealand                          NZ
...                                         ...                         ...
18248  ABC Aerolineas S.A. de C.V. dba Interjet                          4O
18308                Hong Kong Airlines Limited                          HX
18466                                    Iberia                          IB
18609                                French Bee                          BF
18797                            Icelandair EHF                          FI

[74 rows x 2 columns]

## Airline Fleet cost DB

In [36]:
#loading airlie fleet data
path_to_file3 = os.path.join('Resources','Fleet Data.csv')
Fleet_Data_df = pd.read_csv(path_to_file3)
Fleet_Data_df.head(5)

,Parent Airline,Airline,Aircraft Type,Current,Future,Historic,Total,Orders,Unit Cost,Total Cost (Current),Average Age
0,Aegean Airlines,Aegean Airlines,Airbus A319,1.0,NaN,3.0,4.0,NaN,$90,$90,11.6
1,Aegean Airlines,Olympic Air,Airbus A319,NaN,NaN,8.0,8.0,NaN,$90,$0,NaN
2,Aegean Airlines,Aegean Airlines,Airbus A320,38.0,NaN,3.0,41.0,NaN,$98,"$3,724",7.5
3,Aegean Airlines,Olympic Air,Airbus A320,NaN,NaN,9.0,9.0,NaN,$98,$0,NaN
4,Aegean Airlines,Aegean Airlines,Airbus A321,8.0,NaN,NaN,8.0,NaN,$115,$919,10.3

In [37]:
#dropping columns total, future, historic, orders as irrelevant, keeping only current, only matters how many airline has now
#if airline doesn't have airlplane it is filtered out
Fleet_Data_df = Fleet_Data_df.drop(['Total', 'Future', 'Historic', 'Orders'],1)
Fleet_Data_df = Fleet_Data_df. dropna(subset=['Current'])
Fleet_Data_df.head(5)

,Parent Airline,Airline,Aircraft Type,Current,Unit Cost,Total Cost (Current),Average Age
0,Aegean Airlines,Aegean Airlines,Airbus A319,1.0,$90,$90,11.6
2,Aegean Airlines,Aegean Airlines,Airbus A320,38.0,$98,"$3,724",7.5
4,Aegean Airlines,Aegean Airlines,Airbus A321,8.0,$115,$919,10.3
5,Aegean Airlines,Olympic Air,ATR 42/72,2.0,$22,$44,2.4
9,Aegean Airlines,Olympic Air,De Havilland Canada DHC-8 Dash 8,12.0,$31,$376,12.6

In [38]:
for column in Fleet_Data_df: 
    null_nr = Fleet_Data_df[column].isnull().sum()
    print(f'{column} has {null_nr} missing data' )
    #Fleet_Data_df[column] = Fleet_Data_df[column].fillna()

Fleet_Data_df = Fleet_Data_df.dropna()

Parent Airline has 0 missing data
Airline has 0 missing data
Aircraft Type has 0 missing data
Current has 0 missing data
Unit Cost has 19 missing data
Total Cost (Current) has 12 missing data
Average Age has 39 missing data

In [39]:
for column in Fleet_Data_df: 
    null_nr = Fleet_Data_df[column].isnull().sum()
    
    print(f'{column} has {null_nr} missing data' )

Parent Airline has 0 missing data
Airline has 0 missing data
Aircraft Type has 0 missing data
Current has 0 missing data
Unit Cost has 0 missing data
Total Cost (Current) has 0 missing data
Average Age has 0 missing data

In [40]:
#removing $ sign
#renaming columns 
Fleet_Data_df = Fleet_Data_df.rename(columns={"Unit Cost": "Unit Cost M$", 'Total Cost (Current)': 'Total Cost $M'})

#converting str to int and remving $
for column in Fleet_Data_df:
    if Fleet_Data_df[column].dtype == object:
        Fleet_Data_df[column] = Fleet_Data_df[column].str.replace('$', '')
        Fleet_Data_df[column] = Fleet_Data_df[column].str.replace(',', '')
        
Fleet_Data_df["Unit Cost M$"] = Fleet_Data_df["Unit Cost M$"].astype(int)
Fleet_Data_df["Total Cost $M"] = Fleet_Data_df["Total Cost $M"].astype(int)

In [41]:
Fleet_Data_df.dtypes

Parent Airline     object
Airline            object
Aircraft Type      object
Current           float64
Unit Cost M$        int32
Total Cost $M       int32
Average Age       float64
dtype: object

In [42]:
Fleet_Data_df

,Parent Airline,Airline,Aircraft Type,Current,Unit Cost M$,Total Cost $M,Average Age
0,Aegean Airlines,Aegean Airlines,Airbus A319,1.0,90,90,11.6
2,Aegean Airlines,Aegean Airlines,Airbus A320,38.0,98,3724,7.5
4,Aegean Airlines,Aegean Airlines,Airbus A321,8.0,115,919,10.3
5,Aegean Airlines,Olympic Air,ATR 42/72,2.0,22,44,2.4
9,Aegean Airlines,Olympic Air,De Havilland Canada DHC-8 Dash 8,12.0,31,376,12.6
...,...,...,...,...,...,...,...
1577,WestJet,WestJet,Boeing 737,114.0,74,8434,8.3
1579,WestJet,WestJet,Boeing 767,4.0,187,748,24.5
1580,WestJet,WestJet Encore,De Havilland Canada DHC-8 Dash 8,33.0,31,1033,2.0
1581,Wizz Air,Wizz Air,Airbus A320,63.0,98,6174,5.1
1582,Wizz Air,Wizz Air,Airbus A321,11.0,115,1264,0.6

In [43]:
Fleet_Data_numbers_df = Fleet_Data_df.drop(['Airline', 'Aircraft Type'],1)
display(Fleet_Data_numbers_df)

       Parent Airline  Current  Unit Cost M$  Total Cost $M  Average Age
0     Aegean Airlines      1.0            90             90         11.6
2     Aegean Airlines     38.0            98           3724          7.5
4     Aegean Airlines      8.0           115            919         10.3
5     Aegean Airlines      2.0            22             44          2.4
9     Aegean Airlines     12.0            31            376         12.6
...               ...      ...           ...            ...          ...
1577          WestJet    114.0            74           8434          8.3
1579          WestJet      4.0           187            748         24.5
1580          WestJet     33.0            31           1033          2.0
1581         Wizz Air     63.0            98           6174          5.1
1582         Wizz Air     11.0           115           1264          0.6

[809 rows x 5 columns]

In [44]:
Fleet_cost = Fleet_Data_numbers_df.groupby(['Parent Airline']).sum()['Unit Cost M$']
#Fleet_cost

In [45]:
Fleet_age_mean = Fleet_Data_numbers_df.groupby(['Parent Airline']).mean()['Average Age']
#Fleet_age_mean

In [46]:
Fleet_age_std = Fleet_Data_numbers_df.groupby(['Parent Airline']).std()['Average Age']
#Fleet_age_std

In [47]:
airline_fleet_cost = Fleet_Data_numbers_df.groupby(['Parent Airline']).sum()
airline_fleet_cost['Fleet Age Average'] = Fleet_age_mean
airline_fleet_cost['Fleet Age Distribution'] = Fleet_age_std
airline_fleet_cost = airline_fleet_cost.drop(['Average Age'],1)
airline_fleet_cost = airline_fleet_cost.rename(columns = {'Current': "Total nr of units"})

In [48]:
airline_fleet_cost

,Total nr of units,Unit Cost M$,Total Cost $M,Fleet Age Average,Fleet Age Distribution
Parent Airline,,,,,
Aegean Airlines,61.0,356,5153,8.880000,4.097194
Aeroflot,280.0,1918,32613,8.664286,5.974640
Aerolineas Argentinas,80.0,576,7398,10.150000,6.314270
Air Algerie,56.0,523,4919,13.350000,8.689649
Air Arabia,46.0,392,4508,6.725000,3.606822
...,...,...,...,...,...
Virgin Australia,147.0,1041,11516,9.820000,6.834195
Volaris,68.0,303,6690,4.533333,4.673685
WestJet,151.0,292,10215,11.600000,11.607325
Wizz Air,74.0,213,7438,2.850000,3.181981
easyJet,260.0,376,24271,5.925000,2.578598

## Summary of tables

In [49]:
print('\n airline_name_df')
display(airline_name_df.head(3))

print('\n Fleet_Data_df')
display(airline_fleet_cost.head(3))

print('\n SFO_Landing_statistics_df')
display(SFO_Landing_statistics_df.head(3))

print('\n SFO_Passanger_statistics_df')
display(SFO_Passanger_statistics_df.head(3))

print('\n SFO grand data')
display(SFO_data_df)

 airline_name_df

  Published Airline Published Airline IATA Code
0      ATA Airlines                          TZ
3        Air Canada                          AC
5         Air China                          CA

 Fleet_Data_df

,Total nr of units,Unit Cost M$,Total Cost $M,Fleet Age Average,Fleet Age Distribution
Parent Airline,,,,,
Aegean Airlines,61.0,356,5153,8.880000,4.097194
Aeroflot,280.0,1918,32613,8.664286,5.974640
Aerolineas Argentinas,80.0,576,7398,10.150000,6.314270

 SFO_Landing_statistics_df

,Activity Period,Published Airline,Published Airline IATA Code,GEO Summary,GEO Region,Landing Aircraft Type,Aircraft Manufacturer,Aircraft Model,Landing Count,Total Landed Weight
0,2002-04-01,ATA Airlines,TZ,Domestic,US,Passenger,Boeing,757,83,16434000
1,2002-04-01,ATA Airlines,TZ,Domestic,US,Passenger,Boeing,757,3,672000
2,2002-04-01,ATA Airlines,TZ,Domestic,US,Passenger,Lockheed,L1011,27,9666000

 SFO_Passanger_statistics_df

,Activity Period,Published Airline,Published Airline IATA Code,GEO Summary,GEO Region,Activity Type Code,Price Category Code,Passenger Count
0,2005-07-01,ATA Airlines,TZ,Domestic,US,Deplaned,Low Fare,27271
1,2005-07-01,ATA Airlines,TZ,Domestic,US,Enplaned,Low Fare,29131
2,2005-07-01,ATA Airlines,TZ,Domestic,US,Thru / Transit,Low Fare,5415

 SFO grand data

,Activity Period,Published Airline,Published Airline IATA Code,GEO Summary,GEO Region,Activity Type Code,Price Category Code,Passenger Count,Published Airline_y,Landing Aircraft Type,Aircraft Manufacturer,Aircraft Model,Landing Count,Total Landed Weight
0,2005-07-01,ATA Airlines,TZ,Domestic,US,Deplaned,Low Fare,27271,ABX Air,Freighter,McDonnell Douglas,DC-9,40,4066000
1,2005-07-01,ATA Airlines,TZ,Domestic,US,Deplaned,Low Fare,27271,ABX Air,Freighter,McDonnell Douglas,DC-9,1,102000
2,2005-07-01,ATA Airlines,TZ,Domestic,US,Deplaned,Low Fare,27271,ATA Airlines,Passenger,Boeing,757,2,396000
3,2005-07-01,ATA Airlines,TZ,Domestic,US,Deplaned,Low Fare,27271,ATA Airlines,Passenger,Boeing,757,167,37408000
4,2005-07-01,ATA Airlines,TZ,Domestic,US,Deplaned,Low Fare,27271,Air Canada,Passenger,Boeing,767,1,320000
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2626379,2018-06-01,XL Airways France,SE,International,Europe,Enplaned,Other,1243,WOW Air,Passenger,Airbus,A333,30,12235650
2626380,2018-06-01,XL Airways France,SE,International,Europe,Enplaned,Other,1243,WestJet Airlines,Passenger,Boeing,B736,3,361500
2626381,2018-06-01,XL Airways France,SE,International,Europe,Enplaned,Other,1243,WestJet Airlines,Passenger,Boeing,B737,71,9173200
2626382,2018-06-01,XL Airways France,SE,International,Europe,Enplaned,Other,1243,WestJet Airlines,Passenger,Boeing,B738,16,2340800
2626383,2018-06-01,XL Airways France,SE,International,Europe,Enplaned,Other,1243,XL Airways France,Passenger,Airbus,A332,4,1604964

# Uploading the data to postreg

In [50]:
import sqlalchemy

In [51]:
import psycopg2

In [52]:
import sqlalchemy  # Package for accessing SQL databases via Python

# Connect to database (Note: The package psychopg2 is required for Postgres to work with SQLAlchemy)
engine = sqlalchemy.create_engine("postgresql://postgres:BlackSheepWall#1@localhost/Almost_Best_airline")
con = engine.connect()

# Verify that there are no existing tables
print(engine.table_names())

[]

In [53]:
# table_name1 = 'airline_info'
# airline_info_basic_df.to_sql(table_name1, con)

In [54]:
table_name1 = 'airline_name'
table_name2 = 'airline_fleet_cost'
table_name3 = 'SFO_Landing_statistics'
table_name4 = 'SFO_Passanger_statistics_df'
table_name5 = 'SFO_data_df'

try:
    airline_name_df.to_sql(table_name1, con)
    airline_fleet_cost.to_sql(table_name2, con)
    SFO_Landing_statistics_df.to_sql(table_name3, con)
    SFO_Passanger_statistics_df.to_sql(table_name4, con)
    SFO_data_df.to_sql(table_name5, con)

except(ValueError):
    print('Table already exist')
    pass

In [55]:
#checking if data was uploaded to sql correctly
print(engine.table_names())

['airline_name', 'airline_fleet_cost', 'SFO_Landing_statistics', 'SFO_Passanger_statistics_df', 'SFO_data_df']

Readout from postregsql

In [56]:
#Read out from SQL
test_df = pd.read_sql_table('airline_name',engine)
test_df

,index,Published Airline,Published Airline IATA Code
0,0,ATA Airlines,TZ
1,3,Air Canada,AC
2,5,Air China,CA
3,7,Air France,AF
4,9,Air New Zealand,NZ
...,...,...,...
69,18248,ABC Aerolineas S.A. de C.V. dba Interjet,4O
70,18308,Hong Kong Airlines Limited,HX
71,18466,Iberia,IB
72,18609,French Bee,BF
73,18797,Icelandair EHF,FI

In [57]:
SFO_data_df

,Activity Period,Published Airline,Published Airline IATA Code,GEO Summary,GEO Region,Activity Type Code,Price Category Code,Passenger Count,Published Airline_y,Landing Aircraft Type,Aircraft Manufacturer,Aircraft Model,Landing Count,Total Landed Weight
0,2005-07-01,ATA Airlines,TZ,Domestic,US,Deplaned,Low Fare,27271,ABX Air,Freighter,McDonnell Douglas,DC-9,40,4066000
1,2005-07-01,ATA Airlines,TZ,Domestic,US,Deplaned,Low Fare,27271,ABX Air,Freighter,McDonnell Douglas,DC-9,1,102000
2,2005-07-01,ATA Airlines,TZ,Domestic,US,Deplaned,Low Fare,27271,ATA Airlines,Passenger,Boeing,757,2,396000
3,2005-07-01,ATA Airlines,TZ,Domestic,US,Deplaned,Low Fare,27271,ATA Airlines,Passenger,Boeing,757,167,37408000
4,2005-07-01,ATA Airlines,TZ,Domestic,US,Deplaned,Low Fare,27271,Air Canada,Passenger,Boeing,767,1,320000
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2626379,2018-06-01,XL Airways France,SE,International,Europe,Enplaned,Other,1243,WOW Air,Passenger,Airbus,A333,30,12235650
2626380,2018-06-01,XL Airways France,SE,International,Europe,Enplaned,Other,1243,WestJet Airlines,Passenger,Boeing,B736,3,361500
2626381,2018-06-01,XL Airways France,SE,International,Europe,Enplaned,Other,1243,WestJet Airlines,Passenger,Boeing,B737,71,9173200
2626382,2018-06-01,XL Airways France,SE,International,Europe,Enplaned,Other,1243,WestJet Airlines,Passenger,Boeing,B738,16,2340800
2626383,2018-06-01,XL Airways France,SE,International,Europe,Enplaned,Other,1243,XL Airways France,Passenger,Airbus,A332,4,1604964